dj-oyu/esp32p4-mqjs/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_SPIRAM=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# M5Stamp-P4 ships chip revision v1.x; IDF 6.0 defaults to v3.01 (ECO5)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# App exceeds the default 1MB factory partition once the WiFi stack is in
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# WiFi via Stamp-AddOn C6 (esp-hosted slave over SDIO, esp_wifi_remote on host).
# P4 SDMMC slot 0 has fixed IOMUX pins, so the Stamp wiring needs slot 1
# (GPIO matrix): CLK=43 CMD=44 D0..D3=45..48, C6 reset on GPIO42.
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=43
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=44
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=45
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=46
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=47
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=48
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=42
